pgf_tikz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-02 Mon 23:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Drawing with PGF/Tikz</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Drawing with PGF/Tikz</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Setting</a></li>
<li><a href="#orgheadline2">2. Style</a></li>
<li><a href="#orgheadline3">3. Coordinate</a></li>
<li><a href="#orgheadline4">4. List</a></li>
<li><a href="#orgheadline5">5. Arrow</a></li>
<li><a href="#orgheadline15">6. Draw</a>
<ul>
<li><a href="#orgheadline6">6.1. Line</a></li>
<li><a href="#orgheadline7">6.2. Curve</a></li>
<li><a href="#orgheadline8">6.3. Grid</a></li>
<li><a href="#orgheadline9">6.4. Arc</a></li>
<li><a href="#orgheadline10">6.5. Rectangle</a></li>
<li><a href="#orgheadline11">6.6. Circle</a></li>
<li><a href="#orgheadline12">6.7. Ellipse</a></li>
<li><a href="#orgheadline14">6.8. Node</a>
<ul>
<li><a href="#orgheadline13">6.8.1. Connecting nodes with</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline16">7. Refer to nodes outside current picture</a></li>
<li><a href="#orgheadline17">8. Mix tikz command with LaTeX</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Setting</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #a020f0;">\usepackage</span>{<span style="color: #0000ff;">tikz</span>}
...
<span style="color: #696969;">\tikz</span> ...
<span style="color: #a020f0;">\begin</span>{<span style="color: #0000ff;">tikzpicture</span>}
...
<span style="color: #a020f0;">\end</span>{<span style="color: #0000ff;">tikzpicture</span>}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Style</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\tikzstyle</span> newstylename=[option1=value1, option2=value2, ...]
<span style="color: #696969;">\tikzstyle</span> existingstylename+=[option1=value1, option2=value2, ...]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Coordinate</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>(x0, y0)</li>
<li>(angle, radius)</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> List</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #b22222;">% </span><span style="color: #b22222;">step length = 1</span>
{a, ..., b}
...
<span style="color: #b22222;">% </span><span style="color: #b22222;">step length = d</span>
{a, a + d, ..., b}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Arrow</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>-</li>
<li>-&gt;</li>
<li>&lt;-</li>
<li>&lt;-&gt;</li>
<li>-&gt;&gt;</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">6</span> Draw</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">6.1</span> Line</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> (x1, y1) -- (x2, y2) -- (x3, y3) -- cycle
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">6.2</span> Curve</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> (x1, y1) .. controls (x2, y2) and (x3, y3) .. (x4, y4);
<span style="color: #696969;">\draw</span> (x1, y1) .. controls (x2, y2) .. (x3, y3);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">6.3</span> Grid</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> [step=s] (x1, y1) grid (x2, y2);
<span style="color: #696969;">\draw</span> [xstep=x_s, ystep=y_s] (x1, y1) grid (x2, y2);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">6.4</span> Arc</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> (x1, y1) arc (start_angle: end_angle: radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">6.5</span> Rectangle</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> (x1, y1) rectangle (x2, y2);
<span style="color: #696969;">\fill</span> [color] (x1, y1) rectangle (x2, y2);
<span style="color: #696969;">\filldraw</span> [fill=color1, draw=color2] (x1, y1) rectangle (x2, y2);
<span style="color: #696969;">\shade</span> [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) rectangle (x2, y2);
<span style="color: #696969;">\shadedraw</span> [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) rectangle (x2, y2);
<span style="color: #696969;">\clip</span> (x1, y1) rectangle (x2, y2);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">6.6</span> Circle</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> (x1, y1) circle (radius);
<span style="color: #696969;">\fill</span> [color] (x1, y1) circle (radius);
<span style="color: #696969;">\filldraw</span> [fill=color1, draw=color2] (x1, y1) circle (radius);
<span style="color: #696969;">\shade</span> [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) circle (radius);
<span style="color: #696969;">\shadedraw</span> [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) circle (radius);
<span style="color: #696969;">\clip</span> (x1, y1) circle (radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">6.7</span> Ellipse</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> (x1, y1) ellipse (x_radius and y_radius);
<span style="color: #696969;">\fill</span> [color] (x1, y1) ellipse (x_radius and y_radius);
<span style="color: #696969;">\filldraw</span> [fill=color1, draw=color2] (x1, y1) ellipse (x_radius and y_radius);
<span style="color: #696969;">\shade</span> [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) ellipse (x_radius and y_radius);
<span style="color: #696969;">\shadedraw</span> [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) ellipse (x_radius and y_radius);
<span style="color: #696969;">\clip</span> (x1, y1) ellipse (x_radius and y_radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">6.8</span> Node</h3>
<div class="outline-text-3" id="text-6-8">
<div class="org-src-container">

<pre class="src src-latex">(x0, y0) node [anchor=north/south/east/west, shape=circle/rectangle/ellipse, draw=color1, fill=color2, label=angle:node_label_angle] (node_name) {node_label};
...
<span style="color: #696969;">\node</span> at (x0, y0) (node_name) {node_label};
</pre>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">6.8.1</span> Connecting nodes with</h4>
<div class="outline-text-4" id="text-6-8-1">
<ul class="org-ul">
<li>Lines</li>
</ul>
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> [arrow] (node_name_A) to (node_name_B);
<span style="color: #696969;">\draw</span> (node_name_A) edge [arrow, color] (node_name_B);
</pre>
</div>
<ul class="org-ul">
<li>Curves</li>
</ul>
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\draw</span> [arrow] (node_name_A) to [bend left/right=30] (node_name_B);
<span style="color: #696969;">\draw</span> [arrow] (node_name_A) to [in=30, out=60] (node_name_B);
<span style="color: #696969;">\draw</span> (node_name_A) edge [arrow, color, in=30, out=60] (node_name_B);
<span style="color: #696969;">\draw</span> (node_name_A) edge [arrow, color, bend left/right=30] (node_name_B);
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">7</span> Refer to nodes outside current picture</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\tikzstyle</span>{every picture}+=[remember picture]
...
<span style="color: #696969;">\tikz</span>[overlay]
<span style="color: #a020f0;">\begin</span>{<span style="color: #0000ff;">tikzpicture</span>}[overlay]
...
<span style="color: #a020f0;">\end</span>{<span style="color: #0000ff;">tikzpicture</span>}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">8</span> Mix tikz command with LaTeX</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-latex"><span style="color: #696969;">\tikz</span> [baseline] ...
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shaka</p>
<p class="date">Created: 2015-11-02 Mon 23:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
